{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 183,
   "id": "9bbd2153",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 184,
   "id": "8156bb87",
   "metadata": {},
   "outputs": [],
   "source": [
    "dados_brutos = pd.read_csv('pokemon_sujo_para_etl.csv')\n",
    "df = dados_brutos.copy()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 185,
   "id": "962f5f02",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0           Bulbasaur\n",
      "1             Ivysaur\n",
      "2            Venusaur\n",
      "3       Venusaur-mega\n",
      "4       Venusaur-gmax\n",
      "5          Charmander\n",
      "6          Charmeleon\n",
      "7           Charizard\n",
      "8    Charizard-mega-x\n",
      "9    Charizard-mega-y\n",
      "Name: name, dtype: str\n"
     ]
    }
   ],
   "source": [
    "df[\"name\"] = df[\"name\"].str.strip()\n",
    "df[\"name\"] = df[\"name\"].str.lower()\n",
    "df[\"name\"] = df[\"name\"].str.capitalize()\n",
    "print(df[\"name\"].head(10))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 186,
   "id": "99dc2904",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0    Poison\n",
      "1    Poison\n",
      "2    Poison\n",
      "3    Poison\n",
      "4    Poison\n",
      "5      None\n",
      "6      None\n",
      "7    Flying\n",
      "8    Dragon\n",
      "9    Flying\n",
      "Name: type2, dtype: str\n",
      "0    Grass\n",
      "1    Grass\n",
      "2    Grass\n",
      "3    Grass\n",
      "4    Grass\n",
      "5     Fire\n",
      "6     Fire\n",
      "7     Fire\n",
      "8     Fire\n",
      "9     Fire\n",
      "Name: type1, dtype: str\n"
     ]
    }
   ],
   "source": [
    "df[\"type1\"] = df[\"type1\"].str.strip()\n",
    "df[\"type1\"] = df[\"type1\"].str.lower()\n",
    "df[\"type1\"] = df[\"type1\"].str.capitalize()\n",
    "df[\"type2\"] = df[\"type2\"].str.strip()\n",
    "df[\"type2\"] = df[\"type2\"].str.lower()\n",
    "df[\"type2\"] = df[\"type2\"].str.capitalize()\n",
    "df[\"type2\"] = df[\"type2\"].replace(\"No_type\", \"None\")\n",
    "print(df[\"type2\"].head(10))\n",
    "print(df[\"type1\"].head(10))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 187,
   "id": "028d685d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0            None\n",
      "1            None\n",
      "2            None\n",
      "3            None\n",
      "4            None\n",
      "         ...     \n",
      "95    Anger-point\n",
      "96    Anger-point\n",
      "97     Flash-fire\n",
      "98     Flash-fire\n",
      "99     Flash-fire\n",
      "Name: ability2, Length: 100, dtype: str\n",
      "['None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'Tangled-feet', 'Tangled-feet', 'Tangled-feet', 'None', 'Guts', 'Hustle', 'Guts', 'Hustle', 'Hustle', 'None', 'None', 'Shed-skin', 'Shed-skin', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'Rivalry', 'Rivalry', 'Rivalry', 'Rivalry', 'Rivalry', 'Rivalry', 'Magic-guard', 'Magic-guard', 'None', 'None', 'None', 'None', 'Competitive', 'Competitive', 'None', 'None', 'None', 'None', 'None', 'Dry-skin', 'Dry-skin', 'Tinted-lens', 'Tinted-lens', 'Arena-trap', 'Tangling-hair', 'Arena-trap', 'Tangling-hair', 'Technician', 'Technician', 'Tough-claws', 'Technician', 'Technician', 'Technician', 'Cloud-nine', 'Cloud-nine', 'Anger-point', 'Anger-point', 'Flash-fire', 'Flash-fire', 'Flash-fire', 'Flash-fire', 'Damp', 'Damp', 'Damp', 'Inner-focus', 'Inner-focus', 'Inner-focus', 'None', 'No-guard', 'No-guard', 'No-guard', 'No-guard', 'None', 'None', 'None', 'Liquid-ooze', 'Liquid-ooze', 'Sturdy', 'Sturdy', 'Sturdy', 'Sturdy', 'Sturdy', 'Sturdy', 'Flash-fire', 'Pastel-veil', 'Flash-fire', 'Pastel-veil', 'Own-tempo', 'Own-tempo', 'Own-tempo', 'None', 'Own-tempo', 'Sturdy', 'Sturdy', 'Inner-focus', 'None', 'Early-bird', 'Early-bird', 'Hydration', 'Hydration', 'Sticky-hold', 'Gluttony', 'Sticky-hold', 'Gluttony', 'Skill-link', 'Skill-link', 'None', 'None', 'None', 'None', 'None', 'Sturdy', 'Forewarn', 'Forewarn', 'Shell-armor', 'Shell-armor', 'Shell-armor', 'Static', 'Static', 'Static', 'Static', 'None', 'None', 'None', 'Lightning-rod', 'Lightning-rod', 'Lightning-rod', 'Lightning-rod', 'Reckless', 'Iron-fist', 'Oblivious', 'Neutralizing-gas', 'Neutralizing-gas', 'Neutralizing-gas', 'Rock-head', 'Rock-head', 'Serene-grace', 'Leaf-guard', 'Scrappy', 'None', 'Sniper', 'Sniper', 'Water-veil', 'Water-veil', 'Natural-cure', 'Natural-cure', 'Filter', 'Screen-cleaner', 'Technician', 'Forewarn', 'None', 'None', 'Mold-breaker', 'None', 'Anger-point', 'Anger-point', 'Anger-point', 'Anger-point', 'None', 'None', 'None', 'Shell-armor', 'Shell-armor', 'None', 'Adaptability', 'Adaptability', 'Adaptability', 'None', 'None', 'None', 'Download', 'Shell-armor', 'Shell-armor', 'Battle-armor', 'Battle-armor', 'Pressure', 'None', 'Thick-fat', 'Thick-fat', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'None', 'Keen-eye', 'Keen-eye', 'Keen-eye', 'Keen-eye', 'Early-bird', 'Early-bird', 'Insomnia', 'Insomnia', 'None', 'Illuminate', 'Illuminate', 'None', 'Magic-guard', 'Competitive', 'Serene-grace', 'Serene-grace', 'Early-bird', 'Early-bird', 'None', 'None', 'None', 'None', 'None', 'Huge-power', 'Huge-power', 'Rock-head', 'Damp', 'Leaf-guard', 'Leaf-guard', 'Leaf-guard', 'Pickup', 'Solar-power', 'Solar-power', 'Compound-eyes', 'Water-absorb', 'Water-absorb', 'Water-absorb', 'None', 'None', 'Super-luck', 'Own-tempo', 'Own-tempo', 'None', 'None', 'None', 'Early-bird', 'None', 'None', 'Run-away', 'Sand-veil', 'Sturdy', 'None', 'Run-away', 'Quick-feet', 'Swift-swim', 'Swift-swim', 'Technician', 'None']\n"
     ]
    }
   ],
   "source": [
    "df[\"ability1\"] = df[\"ability1\"].str.strip()\n",
    "df[\"ability1\"] = df[\"ability1\"].str.lower()\n",
    "df[\"ability1\"] = df[\"ability1\"].str.capitalize()\n",
    "df[\"ability2\"] = df[\"ability2\"].str.strip()\n",
    "df[\"ability2\"] = df[\"ability2\"].str.lower()\n",
    "df[\"ability2\"] = df[\"ability2\"].str.capitalize()\n",
    "\n",
    "df[\"ability2\"] = df[\"ability2\"].replace(\"N/a\", \"None\")\n",
    "df[\"ability2\"] = df[\"ability2\"].replace(\"No_ability\", \"None\") \n",
    "df[\"ability2\"] = df[\"ability2\"].replace(\"Nan\", \"None\")\n",
    "df[\"ability2\"] = df[\"ability2\"].replace(\"Null\", \"None\")\n",
    "df[\"ability2\"] = df[\"ability2\"].replace(\"Sem_habilidade\", \"None\")\n",
    "df[\"ability2\"] = df[\"ability2\"].replace(\"No-ability\", \"None\")\n",
    "df[\"ability2\"] = df[\"ability2\"].replace(\"\", \"None\")\n",
    "df[\"ability2\"] = df[\"ability2\"].fillna(\"None\")\n",
    "\n",
    "\n",
    "print(df[\"ability2\"].head(100))\n",
    "lista = [df[\"ability2\"].iloc[i] for i in range(300)]\n",
    "print(lista)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 188,
   "id": "d2080d3e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0     Chlorophyll\n",
      "1     Chlorophyll\n",
      "2     Chlorophyll\n",
      "3            None\n",
      "4     Chlorophyll\n",
      "         ...     \n",
      "95        Defiant\n",
      "96        Defiant\n",
      "97      Justified\n",
      "98      Rock-head\n",
      "99      Justified\n",
      "Name: hidden_ability, Length: 100, dtype: str\n"
     ]
    }
   ],
   "source": [
    "df[\"hidden_ability\"] = df[\"hidden_ability\"].str.strip()\n",
    "df[\"hidden_ability\"] = df[\"hidden_ability\"].str.lower()\n",
    "df[\"hidden_ability\"] = df[\"hidden_ability\"].str.capitalize()\n",
    "\n",
    "print(df[\"hidden_ability\"].head(100))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 189,
   "id": "0abd8eec",
   "metadata": {},
   "outputs": [],
   "source": [
    "df[\"total_stats\"] = df[\"hp\"] + df[\"attack\"] + df[\"defense\"] + df[\"sp_atk\"] + df[\"sp_def\"] + df[\"speed\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 190,
   "id": "6060314f",
   "metadata": {},
   "outputs": [],
   "source": [
    "romanos = {'i': '1', 'ii': '2', 'iii': '3', 'iv': '4', 'v': '5', 'vi': '6', 'vii': '7', 'viii': '8', 'ix': '9'}\n",
    "\n",
    "df[\"generation\"] = df[\"generation\"].astype(str)\n",
    "df[\"generation\"] = df[\"generation\"].str.strip()\n",
    "df[\"generation\"] = df[\"generation\"].str.lower()\n",
    "df[\"generation\"] = df[\"generation\"].replace(\" \", \"\")\n",
    "df['generation'] = df['generation'].str.split('-').str[-1].map(romanos)\n",
    "\n",
    "lista = []\n",
    "for i in range(1, len(df)):\n",
    "    if pd.isna(df[\"generation\"].iloc[i]):\n",
    "        # para o Pandas aceitar a alteração real no loop idêntico, usa-se o .iat\n",
    "        df.iat[i, df.columns.get_loc(\"generation\")] = df[\"generation\"].iloc[i - 1]\n",
    "    \n",
    "    lista.append(df[\"generation\"].iloc[i])\n",
    "\n",
    "# print(len(lista))\n",
    "# print(lista)\n",
    "# lista feita para verificar se o loop acima funcionou corretamente"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 191,
   "id": "dc433882",
   "metadata": {},
   "outputs": [],
   "source": [
    "df[\"Smogon_VGC_Usage_2022\"] = df[\"Smogon_VGC_Usage_2022\"].astype(str)\n",
    "df[\"Smogon_VGC_Usage_2022\"] = df[\"Smogon_VGC_Usage_2022\"].str.strip()\n",
    "df[\"Smogon_VGC_Usage_2022\"] = df[\"Smogon_VGC_Usage_2022\"].str.lower()\n",
    "df[\"Smogon_VGC_Usage_2022\"] = df[\"Smogon_VGC_Usage_2022\"].str.replace(\"no_usage\", \"0.0\")\n",
    "df[\"Smogon_VGC_Usage_2022\"] = df[\"Smogon_VGC_Usage_2022\"].str.replace(\"nousage\", \"0.0\")\n",
    "df[\"Smogon_VGC_Usage_2022\"] = df[\"Smogon_VGC_Usage_2022\"].str.replace(\"none\", \"0.0\")\n",
    "df[\"Smogon_VGC_Usage_2022\"] = df[\"Smogon_VGC_Usage_2022\"].str.replace(\"no usage\", \"0.0\")\n",
    "df[\"Smogon_VGC_Usage_2022\"] = df[\"Smogon_VGC_Usage_2022\"].str.replace(\"no\", \"0.0\")\n",
    "df[\"Smogon_VGC_Usage_2022\"] = df[\"Smogon_VGC_Usage_2022\"].str.replace(\"zero\", \"0.0\")\n",
    "\n",
    "df[\"Smogon_VGC_Usage_2022\"] = df[\"Smogon_VGC_Usage_2022\"].replace([\"\", \"-\"], np.nan)\n",
    "\n",
    "df[\"Smogon_VGC_Usage_2022\"] = df[\"Smogon_VGC_Usage_2022\"].fillna(\"0.0\")\n",
    "\n",
    "df[\"Smogon_VGC_Usage_2022\"] = np.where(\n",
    "    df[\"Smogon_VGC_Usage_2022\"].str.contains(\"-\", na=False, regex=False), \n",
    "    \"0.0\", \n",
    "    df[\"Smogon_VGC_Usage_2022\"]\n",
    ")\n",
    "\n",
    "df[\"Smogon_VGC_Usage_2022\"] = df[\"Smogon_VGC_Usage_2022\"].astype(float)\n",
    "\n",
    "# lista = []\n",
    "# for i in range(1, len(df)):\n",
    "#     if df[\"Smogon_VGC_Usage_2022\"].iloc[i] not in lista:\n",
    "#         lista.append(df[\"Smogon_VGC_Usage_2022\"].iloc[i])\n",
    "\n",
    "# print(lista)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 192,
   "id": "da8260f7",
   "metadata": {},
   "outputs": [],
   "source": [
    "df[\"Smogon_VGC_Usage_2023\"] = df[\"Smogon_VGC_Usage_2023\"].astype(str)\n",
    "df[\"Smogon_VGC_Usage_2023\"] = df[\"Smogon_VGC_Usage_2023\"].str.strip()\n",
    "df[\"Smogon_VGC_Usage_2023\"] = df[\"Smogon_VGC_Usage_2023\"].str.lower()\n",
    "df[\"Smogon_VGC_Usage_2023\"] = df[\"Smogon_VGC_Usage_2023\"].str.replace(\"nousage\", \"0.0\")\n",
    "df[\"Smogon_VGC_Usage_2023\"] = df[\"Smogon_VGC_Usage_2023\"].str.replace(\"none\", \"0.0\")\n",
    "df[\"Smogon_VGC_Usage_2023\"] = df[\"Smogon_VGC_Usage_2023\"].str.replace(\"no usage\", \"0.0\")\n",
    "df[\"Smogon_VGC_Usage_2023\"] = df[\"Smogon_VGC_Usage_2023\"].str.replace(\"no\", \"0.0\")\n",
    "df[\"Smogon_VGC_Usage_2023\"] = df[\"Smogon_VGC_Usage_2023\"].str.replace(\"zero\", \"0.0\")\n",
    "\n",
    "df[\"Smogon_VGC_Usage_2023\"] = df[\"Smogon_VGC_Usage_2023\"].replace([\"\", \"-\"], np.nan)\n",
    "\n",
    "df[\"Smogon_VGC_Usage_2023\"] = df[\"Smogon_VGC_Usage_2023\"].fillna(\"0.0\")\n",
    "\n",
    "df[\"Smogon_VGC_Usage_2023\"] = np.where(\n",
    "    df[\"Smogon_VGC_Usage_2023\"].str.contains(\"-\", na=False, regex=False), \n",
    "    \"0.0\", \n",
    "    df[\"Smogon_VGC_Usage_2023\"]\n",
    ")\n",
    "\n",
    "df[\"Smogon_VGC_Usage_2023\"] = df[\"Smogon_VGC_Usage_2023\"].astype(float)\n",
    "\n",
    "# lista1 = []\n",
    "# for i in range(1, len(df)):\n",
    "#     if df[\"Smogon_VGC_Usage_2023\"].iloc[i] not in lista1:\n",
    "#         lista1.append(df[\"Smogon_VGC_Usage_2023\"].iloc[i])\n",
    "\n",
    "# print(lista1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 193,
   "id": "3d94b31e",
   "metadata": {},
   "outputs": [],
   "source": [
    "df[\"Smogon_VGC_Usage_2024\"] = df[\"Smogon_VGC_Usage_2024\"].astype(str)\n",
    "df[\"Smogon_VGC_Usage_2024\"] = df[\"Smogon_VGC_Usage_2024\"].str.strip()\n",
    "df[\"Smogon_VGC_Usage_2024\"] = df[\"Smogon_VGC_Usage_2024\"].str.lower()\n",
    "df[\"Smogon_VGC_Usage_2024\"] = df[\"Smogon_VGC_Usage_2024\"].str.replace(\"nousage\", \"0.0\")\n",
    "df[\"Smogon_VGC_Usage_2024\"] = df[\"Smogon_VGC_Usage_2024\"].str.replace(\"none\", \"0.0\")\n",
    "df[\"Smogon_VGC_Usage_2024\"] = df[\"Smogon_VGC_Usage_2024\"].str.replace(\"no usage\", \"0.0\")\n",
    "df[\"Smogon_VGC_Usage_2024\"] = df[\"Smogon_VGC_Usage_2024\"].str.replace(\"no\", \"0.0\")\n",
    "df[\"Smogon_VGC_Usage_2024\"] = df[\"Smogon_VGC_Usage_2024\"].str.replace(\"zero\", \"0.0\")\n",
    "\n",
    "df[\"Smogon_VGC_Usage_2024\"] = df[\"Smogon_VGC_Usage_2024\"].replace([\"\", \"-\"], np.nan)\n",
    "\n",
    "df[\"Smogon_VGC_Usage_2024\"] = df[\"Smogon_VGC_Usage_2024\"].fillna(\"0.0\")\n",
    "\n",
    "df[\"Smogon_VGC_Usage_2024\"] = np.where(\n",
    "    df[\"Smogon_VGC_Usage_2024\"].str.contains(\"-\", na=False, regex=False), \n",
    "    \"0.0\", \n",
    "    df[\"Smogon_VGC_Usage_2024\"]\n",
    ")\n",
    "\n",
    "df[\"Smogon_VGC_Usage_2024\"] = df[\"Smogon_VGC_Usage_2024\"].astype(float)\n",
    "\n",
    "# lista1 = []\n",
    "# for i in range(1, len(df)):\n",
    "#     if df[\"Smogon_VGC_Usage_2024\"].iloc[i] not in lista1:\n",
    "#         lista1.append(df[\"Smogon_VGC_Usage_2024\"].iloc[i])\n",
    "# print(lista1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 194,
   "id": "2b9fd376",
   "metadata": {},
   "outputs": [],
   "source": [
    "df[\"Worlds_VGC_Usage_2022\"] = df[\"Worlds_VGC_Usage_2022\"].astype(str)\n",
    "df[\"Worlds_VGC_Usage_2022\"] = df[\"Worlds_VGC_Usage_2022\"].str.strip()\n",
    "df[\"Worlds_VGC_Usage_2022\"] = df[\"Worlds_VGC_Usage_2022\"].str.lower()\n",
    "df[\"Worlds_VGC_Usage_2022\"] = df[\"Worlds_VGC_Usage_2022\"].str.replace(\"nousage\", \"0.0\")\n",
    "df[\"Worlds_VGC_Usage_2022\"] = df[\"Worlds_VGC_Usage_2022\"].str.replace(\"none\", \"0.0\")\n",
    "df[\"Worlds_VGC_Usage_2022\"] = df[\"Worlds_VGC_Usage_2022\"].str.replace(\"no usage\", \"0.0\")\n",
    "df[\"Worlds_VGC_Usage_2022\"] = df[\"Worlds_VGC_Usage_2022\"].str.replace(\"no\", \"0.0\")\n",
    "df[\"Worlds_VGC_Usage_2022\"] = df[\"Worlds_VGC_Usage_2022\"].str.replace(\"zero\", \"0.0\")\n",
    "\n",
    "df[\"Worlds_VGC_Usage_2022\"] = df[\"Worlds_VGC_Usage_2022\"].replace([\"\", \"-\"], np.nan)\n",
    "\n",
    "df[\"Worlds_VGC_Usage_2022\"] = df[\"Worlds_VGC_Usage_2022\"].fillna(\"0.0\")\n",
    "\n",
    "df[\"Worlds_VGC_Usage_2022\"] = df[\"Worlds_VGC_Usage_2022\"].astype(float)\n",
    "\n",
    "# lista1 = []\n",
    "# for i in range(1, len(df)):\n",
    "#     if df[\"Worlds_VGC_Usage_2022\"].iloc[i] not in lista1:\n",
    "#         lista1.append(df[\"Worlds_VGC_Usage_2022\"].iloc[i])\n",
    "# print(lista1)\n",
    "        \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 195,
   "id": "0e107113",
   "metadata": {},
   "outputs": [],
   "source": [
    "df[\"Worlds_VGC_Usage_2023\"] = df[\"Worlds_VGC_Usage_2023\"].astype(str)\n",
    "df[\"Worlds_VGC_Usage_2023\"] = df[\"Worlds_VGC_Usage_2023\"].str.strip()\n",
    "df[\"Worlds_VGC_Usage_2023\"] = df[\"Worlds_VGC_Usage_2023\"].str.lower()\n",
    "df[\"Worlds_VGC_Usage_2023\"] = df[\"Worlds_VGC_Usage_2023\"].str.replace(\"nousage\", \"0.0\")\n",
    "df[\"Worlds_VGC_Usage_2023\"] = df[\"Worlds_VGC_Usage_2023\"].str.replace(\"none\", \"0.0\")\n",
    "df[\"Worlds_VGC_Usage_2023\"] = df[\"Worlds_VGC_Usage_2023\"].str.replace(\"no usage\", \"0.0\")\n",
    "df[\"Worlds_VGC_Usage_2023\"] = df[\"Worlds_VGC_Usage_2023\"].str.replace(\"no\", \"0.0\")\n",
    "df[\"Worlds_VGC_Usage_2023\"] = df[\"Worlds_VGC_Usage_2023\"].str.replace(\"zero\", \"0.0\")\n",
    "\n",
    "df[\"Worlds_VGC_Usage_2023\"] = df[\"Worlds_VGC_Usage_2023\"].replace([\"\", \"-\"], np.nan)\n",
    "\n",
    "df[\"Worlds_VGC_Usage_2023\"] = df[\"Worlds_VGC_Usage_2023\"].fillna(\"0.0\")\n",
    "\n",
    "df[\"Worlds_VGC_Usage_2023\"] = df[\"Worlds_VGC_Usage_2023\"].astype(float)\n",
    "\n",
    "# lista1 = []\n",
    "# for i in range(1, len(df)):\n",
    "#     if df[\"Worlds_VGC_Usage_2023\"].iloc[i] not in lista1:\n",
    "#         lista1.append(df[\"Worlds_VGC_Usage_2023\"].iloc[i])\n",
    "\n",
    "# print(lista1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 196,
   "id": "904bda74",
   "metadata": {},
   "outputs": [],
   "source": [
    "df[\"Worlds_VGC_Usage_2024\"] = df[\"Worlds_VGC_Usage_2024\"].astype(str)\n",
    "df[\"Worlds_VGC_Usage_2024\"] = df[\"Worlds_VGC_Usage_2024\"].str.strip()\n",
    "df[\"Worlds_VGC_Usage_2024\"] = df[\"Worlds_VGC_Usage_2024\"].str.lower()\n",
    "df[\"Worlds_VGC_Usage_2024\"] = df[\"Worlds_VGC_Usage_2024\"].str.replace(\"nousage\", \"0.0\")\n",
    "df[\"Worlds_VGC_Usage_2024\"] = df[\"Worlds_VGC_Usage_2024\"].str.replace(\"none\", \"0.0\")\n",
    "df[\"Worlds_VGC_Usage_2024\"] = df[\"Worlds_VGC_Usage_2024\"].str.replace(\"no usage\", \"0.0\")\n",
    "df[\"Worlds_VGC_Usage_2024\"] = df[\"Worlds_VGC_Usage_2024\"].str.replace(\"no\", \"0.0\")\n",
    "df[\"Worlds_VGC_Usage_2024\"] = df[\"Worlds_VGC_Usage_2024\"].str.replace(\"zero\", \"0.0\")\n",
    "\n",
    "df[\"Worlds_VGC_Usage_2024\"] = df[\"Worlds_VGC_Usage_2024\"].replace([\"\", \"-\"], np.nan)\n",
    "\n",
    "df[\"Worlds_VGC_Usage_2024\"] = df[\"Worlds_VGC_Usage_2024\"].fillna(\"0.0\")\n",
    "\n",
    "df[\"Worlds_VGC_Usage_2024\"] = df[\"Worlds_VGC_Usage_2024\"].astype(float)\n",
    "\n",
    "# lista1 = []\n",
    "# for i in range(1, len(df)):\n",
    "#     if df[\"Worlds_VGC_Usage_2024\"].iloc[i] not in lista1:\n",
    "#         lista1.append(df[\"Worlds_VGC_Usage_2024\"].iloc[i])\n",
    "\n",
    "# print(lista1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 197,
   "id": "fc577195",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✓ Dados limpos exportados com sucesso para 'pokemon_limpo.parquet'!\n",
      "✓ DataFrame mantido em memória pronto para a ingestão no Neo4j.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n",
      "[notice] A new release of pip is available: 26.0.1 -> 26.1.2\n",
      "[notice] To update, run: python.exe -m pip install --upgrade pip\n"
     ]
    }
   ],
   "source": [
    "!pip install fastparquet --quiet\n",
    "\n",
    "df.to_parquet('pokemon_limpo.parquet', index=False, engine='fastparquet')\n",
    "print(\"✓ Dados limpos exportados com sucesso para 'pokemon_limpo.parquet'!\")\n",
    "print(\"✓ DataFrame mantido em memória pronto para a ingestão no Neo4j.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3830d10f",
   "metadata": {},
   "source": [
    "NEOJ4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 198,
   "id": "25cb19ff",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n",
      "[notice] A new release of pip is available: 26.0.1 -> 26.1.2\n",
      "[notice] To update, run: python.exe -m pip install --upgrade pip\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Conectado com sucesso!\n"
     ]
    }
   ],
   "source": [
    "!pip install neo4j --quiet\n",
    "from neo4j import GraphDatabase\n",
    "import os\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "\n",
    "load_dotenv()\n",
    "\n",
    "URI = os.getenv(\"NEO4J_URI\")\n",
    "AUTH = (os.getenv(\"NEO4J_USERNAME\"), os.getenv(\"NEO4J_PASSWORD\"))\n",
    "\n",
    "driver = GraphDatabase.driver(\n",
    "    URI,\n",
    "    auth=AUTH\n",
    ")\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(\n",
    "        \"RETURN 'Conectado com sucesso!' AS status\"\n",
    "    )\n",
    "    print(result.single()[\"status\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 199,
   "id": "28f3981b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "BANCO APAGADO\n"
     ]
    }
   ],
   "source": [
    "query_delete = \"MATCH (n) DETACH DELETE n\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    session.run(query_delete)\n",
    "    print(\"BANCO APAGADO\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 200,
   "id": "6f815840",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Iniciando a carga de dados otimizada em lote no Neo4j...\n",
      "✓ Sucesso! Todos os dados injetados de uma só vez em lote.\n"
     ]
    }
   ],
   "source": [
    "print(\"Iniciando a carga de dados otimizada em lote no Neo4j...\")\n",
    "\n",
    "lista_pokemons = []\n",
    "for _, linha in df.iterrows():\n",
    "    lista_pokemons.append({\n",
    "        'name': str(linha['name']),\n",
    "        'index': int(linha['index']),\n",
    "        'hp': int(linha['hp']),\n",
    "        'attack': int(linha['attack']),\n",
    "        'defense': int(linha['defense']),\n",
    "        'sp_atk': int(linha['sp_atk']),\n",
    "        'sp_def': int(linha['sp_def']),\n",
    "        'speed': int(linha['speed']),\n",
    "        'generation': str(linha['generation']),\n",
    "        'type1': str(linha['type1']),\n",
    "        'type2': str(linha['type2']),\n",
    "        'ability1': str(linha['ability1']),\n",
    "        'ability2': str(linha['ability2']),\n",
    "        'hidden_ability': str(linha['hidden_ability']),\n",
    "        'smogon_2022': float(linha['Smogon_VGC_Usage_2022']),\n",
    "        'smogon_2023': float(linha['Smogon_VGC_Usage_2023']),\n",
    "        'smogon_2024': float(linha['Smogon_VGC_Usage_2024']),\n",
    "        'worlds_2022': float(linha['Worlds_VGC_Usage_2022']),\n",
    "        'worlds_2023': float(linha['Worlds_VGC_Usage_2023']),\n",
    "        'worlds_2024': float(linha['Worlds_VGC_Usage_2024'])\n",
    "    })\n",
    "\n",
    "query_lote = \"\"\"\n",
    "UNWIND $linhas AS linha\n",
    "\n",
    "MERGE (p:Pokemon {name: linha.name})\n",
    "SET p.pokedex_number = linha.index,\n",
    "    p.hp = linha.hp,\n",
    "    p.attack = linha.attack,\n",
    "    p.defense = linha.defense,\n",
    "    p.sp_atk = linha.sp_atk,\n",
    "    p.sp_def = linha.sp_def,\n",
    "    p.speed = linha.speed,\n",
    "    p.generation = linha.generation\n",
    "\n",
    "MERGE (t1:Tipo {nome: linha.type1})    \n",
    "MERGE (p)-[:POSSUI_TIPO {ordem: \"principal\"}]->(t1)\n",
    "\n",
    "FOREACH (_ IN CASE WHEN linha.type2 <> 'None' THEN [1] ELSE [] END |\n",
    "    MERGE (t2:Tipo {nome: linha.type2})\n",
    "    MERGE (p)-[:POSSUI_TIPO {ordem: \"secundario\"}]->(t2)\n",
    ")\n",
    "\n",
    "MERGE (a1:Habilidade {nome: linha.ability1})\n",
    "MERGE (p)-[:POSSUI_HABILIDADE {tipo: \"comum\"}]->(a1)\n",
    "\n",
    "FOREACH (_ IN CASE WHEN linha.ability2 <> 'None' THEN [1] ELSE [] END |\n",
    "    MERGE (a2:Habilidade {nome: linha.ability2})\n",
    "    MERGE (p)-[:POSSUI_HABILIDADE {tipo: \"comum\"}]->(a2)\n",
    ")\n",
    "\n",
    "FOREACH (_ IN CASE WHEN linha.hidden_ability <> 'None' THEN [1] ELSE [] END |\n",
    "    MERGE (ha:Habilidade {nome: linha.hidden_ability})\n",
    "    MERGE (p)-[:POSSUI_HABILIDADE {tipo: \"oculta\"}]->(ha)\n",
    ")\n",
    "\n",
    "MERGE (st22:Torneio {nome: \"Smogon VGC\", ano: 2022})\n",
    "MERGE (p)-[r1:COMPETIU_EM]->(st22) SET r1.taxa_uso = linha.smogon_2022\n",
    "\n",
    "MERGE (st23:Torneio {nome: \"Smogon VGC\", ano: 2023})\n",
    "MERGE (p)-[r2:COMPETIU_EM]->(st23) SET r2.taxa_uso = linha.smogon_2023\n",
    "\n",
    "MERGE (st24:Torneio {nome: \"Smogon VGC\", ano: 2024})\n",
    "MERGE (p)-[r3:COMPETIU_EM]->(st24) SET r3.taxa_uso = linha.smogon_2024   \n",
    "\n",
    "MERGE (wt22:Torneio {nome: \"Worlds VGC\", ano: 2022})\n",
    "MERGE (p)-[r4:COMPETIU_EM]->(wt22) SET r4.taxa_uso = linha.worlds_2022\n",
    "\n",
    "MERGE (wt23:Torneio {nome: \"Worlds VGC\", ano: 2023})\n",
    "MERGE (p)-[r5:COMPETIU_EM]->(wt23) SET r5.taxa_uso = linha.worlds_2023   \n",
    "\n",
    "MERGE (wt24:Torneio {nome: \"Worlds VGC\", ano: 2024})\n",
    "MERGE (p)-[r6:COMPETIU_EM]->(wt24) SET r6.taxa_uso = linha.worlds_2024\n",
    "\"\"\"\n",
    "\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        session.run(query_lote, linhas=lista_pokemons)\n",
    "\n",
    "print(\"✓ Sucesso! Todos os dados injetados de uma só vez em lote.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 201,
   "id": "f1524ad6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "            Pokemon  TaxaUso     Torneio   Ano\n",
      "0     Venusaur-mega  0.00000  Smogon VGC  2022\n",
      "1     Venusaur-gmax  0.00000  Smogon VGC  2022\n",
      "2        Charmander  0.00000  Smogon VGC  2022\n",
      "3        Charmeleon  0.00000  Smogon VGC  2022\n",
      "4         Charizard  7.17374  Smogon VGC  2022\n",
      "5  Charizard-mega-x  0.00000  Smogon VGC  2022\n",
      "6  Charizard-mega-y  0.00000  Smogon VGC  2022\n",
      "7    Charizard-gmax  0.00000  Smogon VGC  2022\n",
      "8          Squirtle  0.00000  Smogon VGC  2022\n",
      "9         Wartortle  0.00000  Smogon VGC  2022\n",
      "==================================================\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Pokemon)-[r:COMPETIU_EM]->(t:Torneio)\n",
    "RETURN p.name AS Pokemon, r.taxa_uso AS TaxaUso, t.nome AS Torneio, t.ano AS Ano\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        resultado = session.run(query)\n",
    "        df1 = pd.DataFrame(resultado.data())\n",
    "\n",
    "print(df1)\n",
    "print(50*'=')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "035cd643",
   "metadata": {},
   "source": [
    "\n",
    "## Categoria 1 — Consultas Básicas (Mapeamento de Estrutura Básica)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9f4929d5",
   "metadata": {},
   "source": [
    "Top 10 Pokémon com Maior Velocidade Base"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 202,
   "id": "8be97adb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Pokemon</th>\n",
       "      <th>Velocidade</th>\n",
       "      <th>Geracao</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Regieleki</td>\n",
       "      <td>200</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Deoxys-speed</td>\n",
       "      <td>180</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Ninjask</td>\n",
       "      <td>160</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Pheromosa</td>\n",
       "      <td>151</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Aerodactyl-mega</td>\n",
       "      <td>150</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Electrode-hisui</td>\n",
       "      <td>150</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Deoxys-normal</td>\n",
       "      <td>150</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Alakazam-mega</td>\n",
       "      <td>150</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Electrode</td>\n",
       "      <td>150</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Deoxys-attack</td>\n",
       "      <td>150</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           Pokemon  Velocidade Geracao\n",
       "0        Regieleki         200       8\n",
       "1     Deoxys-speed         180       3\n",
       "2          Ninjask         160       3\n",
       "3        Pheromosa         151       7\n",
       "4  Aerodactyl-mega         150       1\n",
       "5  Electrode-hisui         150       1\n",
       "6    Deoxys-normal         150       3\n",
       "7    Alakazam-mega         150       1\n",
       "8        Electrode         150       1\n",
       "9    Deoxys-attack         150       3"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query_1 = \"\"\"\n",
    "MATCH (p:Pokemon)\n",
    "RETURN p.name AS Pokemon, p.speed AS Velocidade, p.generation AS Geracao\n",
    "ORDER BY Velocidade DESC LIMIT 10\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        display(pd.DataFrame(session.run(query_1).data()))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "030c49eb",
   "metadata": {},
   "source": [
    "Distribuição de Pokémon por Tipo Primário"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 203,
   "id": "f7a1fec3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Tipo</th>\n",
       "      <th>QtdPokemon</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Water</td>\n",
       "      <td>158</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Normal</td>\n",
       "      <td>138</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Grass</td>\n",
       "      <td>118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Electric</td>\n",
       "      <td>96</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bug</td>\n",
       "      <td>93</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Psychic</td>\n",
       "      <td>83</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Rock</td>\n",
       "      <td>81</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Fire</td>\n",
       "      <td>80</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Dark</td>\n",
       "      <td>59</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Fighting</td>\n",
       "      <td>57</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Dragon</td>\n",
       "      <td>52</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Poison</td>\n",
       "      <td>51</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Ghost</td>\n",
       "      <td>51</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Steel</td>\n",
       "      <td>49</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Ground</td>\n",
       "      <td>48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Ice</td>\n",
       "      <td>43</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Fairy</td>\n",
       "      <td>33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Flying</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        Tipo  QtdPokemon\n",
       "0      Water         158\n",
       "1     Normal         138\n",
       "2      Grass         118\n",
       "3   Electric          96\n",
       "4        Bug          93\n",
       "5    Psychic          83\n",
       "6       Rock          81\n",
       "7       Fire          80\n",
       "8       Dark          59\n",
       "9   Fighting          57\n",
       "10    Dragon          52\n",
       "11    Poison          51\n",
       "12     Ghost          51\n",
       "13     Steel          49\n",
       "14    Ground          48\n",
       "15       Ice          43\n",
       "16     Fairy          33\n",
       "17    Flying          13"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query_2 = \"\"\"\n",
    "MATCH (p:Pokemon)-[:POSSUI_TIPO {ordem: \"principal\"}]->(t:Tipo)\n",
    "RETURN t.nome AS Tipo, COUNT(p) AS QtdPokemon\n",
    "ORDER BY QtdPokemon DESC\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        display(pd.DataFrame(session.run(query_2).data()))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a80bf3f8",
   "metadata": {},
   "source": [
    "As 10 Habilidades mais Comuns no Universo Pokémon"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 204,
   "id": "88c37e5d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Habilidade</th>\n",
       "      <th>QtdPokemon</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Sturdy</td>\n",
       "      <td>48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Swift-swim</td>\n",
       "      <td>48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Intimidate</td>\n",
       "      <td>46</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Keen-eye</td>\n",
       "      <td>43</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Levitate</td>\n",
       "      <td>42</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Chlorophyll</td>\n",
       "      <td>39</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Gluttony</td>\n",
       "      <td>39</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Inner-focus</td>\n",
       "      <td>38</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Static</td>\n",
       "      <td>38</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Frisk</td>\n",
       "      <td>38</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    Habilidade  QtdPokemon\n",
       "0       Sturdy          48\n",
       "1   Swift-swim          48\n",
       "2   Intimidate          46\n",
       "3     Keen-eye          43\n",
       "4     Levitate          42\n",
       "5  Chlorophyll          39\n",
       "6     Gluttony          39\n",
       "7  Inner-focus          38\n",
       "8       Static          38\n",
       "9        Frisk          38"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query_3 = \"\"\"\n",
    "MATCH (p:Pokemon)-[:POSSUI_HABILIDADE]->(h:Habilidade)\n",
    "RETURN h.nome AS Habilidade, COUNT(p) AS QtdPokemon\n",
    "ORDER BY QtdPokemon DESC LIMIT 10\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        display(pd.DataFrame(session.run(query_3).data()))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7683e6ce",
   "metadata": {},
   "source": [
    "## Categoria 2 — CONSULTAS COMPLEXAS (Interconexão Multidimensional de Caminhos)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c247204e",
   "metadata": {},
   "source": [
    "O Caminho da Dominância Oculta"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 205,
   "id": "d4757490",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Pokemon</th>\n",
       "      <th>HabilidadeOculta</th>\n",
       "      <th>TaxaUso</th>\n",
       "      <th>Torneio</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Sneasler</td>\n",
       "      <td>Poison-touch</td>\n",
       "      <td>38.21000</td>\n",
       "      <td>Worlds VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Incineroar</td>\n",
       "      <td>Intimidate</td>\n",
       "      <td>36.81468</td>\n",
       "      <td>Smogon VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Incineroar</td>\n",
       "      <td>Intimidate</td>\n",
       "      <td>32.40000</td>\n",
       "      <td>Worlds VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Rillaboom</td>\n",
       "      <td>Grassy-surge</td>\n",
       "      <td>29.72000</td>\n",
       "      <td>Worlds VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Kingambit</td>\n",
       "      <td>Pressure</td>\n",
       "      <td>26.78000</td>\n",
       "      <td>Worlds VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Amoonguss</td>\n",
       "      <td>Regenerator</td>\n",
       "      <td>26.58000</td>\n",
       "      <td>Worlds VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Tornadus-incarnate</td>\n",
       "      <td>Defiant</td>\n",
       "      <td>26.15361</td>\n",
       "      <td>Smogon VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Archaludon</td>\n",
       "      <td>Stalwart</td>\n",
       "      <td>22.70000</td>\n",
       "      <td>Worlds VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Rillaboom</td>\n",
       "      <td>Grassy-surge</td>\n",
       "      <td>22.31496</td>\n",
       "      <td>Smogon VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Dragonite</td>\n",
       "      <td>Multiscale</td>\n",
       "      <td>21.84000</td>\n",
       "      <td>Worlds VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Amoonguss</td>\n",
       "      <td>Regenerator</td>\n",
       "      <td>19.88122</td>\n",
       "      <td>Smogon VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Pelipper</td>\n",
       "      <td>Rain-dish</td>\n",
       "      <td>19.51000</td>\n",
       "      <td>Worlds VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Primarina</td>\n",
       "      <td>Liquid-voice</td>\n",
       "      <td>17.33000</td>\n",
       "      <td>Worlds VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Landorus-incarnate</td>\n",
       "      <td>Sheer-force</td>\n",
       "      <td>17.08534</td>\n",
       "      <td>Smogon VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Annihilape</td>\n",
       "      <td>Defiant</td>\n",
       "      <td>16.80000</td>\n",
       "      <td>Worlds VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Farigiraf</td>\n",
       "      <td>Sap-sipper</td>\n",
       "      <td>16.52409</td>\n",
       "      <td>Smogon VGC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Garchomp</td>\n",
       "      <td>Rough-skin</td>\n",
       "      <td>16.46000</td>\n",
       "      <td>Worlds VGC</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               Pokemon HabilidadeOculta   TaxaUso     Torneio\n",
       "0             Sneasler     Poison-touch  38.21000  Worlds VGC\n",
       "1           Incineroar       Intimidate  36.81468  Smogon VGC\n",
       "2           Incineroar       Intimidate  32.40000  Worlds VGC\n",
       "3            Rillaboom     Grassy-surge  29.72000  Worlds VGC\n",
       "4            Kingambit         Pressure  26.78000  Worlds VGC\n",
       "5            Amoonguss      Regenerator  26.58000  Worlds VGC\n",
       "6   Tornadus-incarnate          Defiant  26.15361  Smogon VGC\n",
       "7           Archaludon         Stalwart  22.70000  Worlds VGC\n",
       "8            Rillaboom     Grassy-surge  22.31496  Smogon VGC\n",
       "9            Dragonite       Multiscale  21.84000  Worlds VGC\n",
       "10           Amoonguss      Regenerator  19.88122  Smogon VGC\n",
       "11            Pelipper        Rain-dish  19.51000  Worlds VGC\n",
       "12           Primarina     Liquid-voice  17.33000  Worlds VGC\n",
       "13  Landorus-incarnate      Sheer-force  17.08534  Smogon VGC\n",
       "14          Annihilape          Defiant  16.80000  Worlds VGC\n",
       "15           Farigiraf       Sap-sipper  16.52409  Smogon VGC\n",
       "16            Garchomp       Rough-skin  16.46000  Worlds VGC"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query_4 = \"\"\"\n",
    "MATCH (h:Habilidade)<-[:POSSUI_HABILIDADE {tipo: \"oculta\"}]-(p:Pokemon)-[r:COMPETIU_EM]->(t:Torneio {ano: 2024})\n",
    "WHERE r.taxa_uso > 15.0\n",
    "RETURN p.name AS Pokemon, \n",
    "       h.nome AS HabilidadeOculta, \n",
    "       r.taxa_uso AS TaxaUso, \n",
    "       t.nome AS Torneio\n",
    "ORDER BY TaxaUso DESC\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        display(pd.DataFrame(session.run(query_4).data()))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "10f5526c",
   "metadata": {},
   "source": [
    "Interseção de Tipos Opostos via Sinergia de Habilidade Compartilhada"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 206,
   "id": "93add409",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>HabilidadeCompartilhada</th>\n",
       "      <th>PokemonFogo</th>\n",
       "      <th>PokemonAgua</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Anger-point</td>\n",
       "      <td>Tauros-paldea-blaze</td>\n",
       "      <td>Tauros-paldea-aqua</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Anger-point</td>\n",
       "      <td>Camerupt</td>\n",
       "      <td>Tauros-paldea-aqua</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Cud-chew</td>\n",
       "      <td>Tauros-paldea-blaze</td>\n",
       "      <td>Tauros-paldea-aqua</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Cursed-body</td>\n",
       "      <td>Marowak-alola</td>\n",
       "      <td>Frillish</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Cursed-body</td>\n",
       "      <td>Marowak-totem</td>\n",
       "      <td>Frillish</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Cursed-body</td>\n",
       "      <td>Marowak-alola</td>\n",
       "      <td>Jellicent</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Cursed-body</td>\n",
       "      <td>Marowak-totem</td>\n",
       "      <td>Jellicent</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Forecast</td>\n",
       "      <td>Castform-sunny</td>\n",
       "      <td>Castform-rainy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Gluttony</td>\n",
       "      <td>Pansear</td>\n",
       "      <td>Panpour</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Gluttony</td>\n",
       "      <td>Simisear</td>\n",
       "      <td>Panpour</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  HabilidadeCompartilhada          PokemonFogo         PokemonAgua\n",
       "0             Anger-point  Tauros-paldea-blaze  Tauros-paldea-aqua\n",
       "1             Anger-point             Camerupt  Tauros-paldea-aqua\n",
       "2                Cud-chew  Tauros-paldea-blaze  Tauros-paldea-aqua\n",
       "3             Cursed-body        Marowak-alola            Frillish\n",
       "4             Cursed-body        Marowak-totem            Frillish\n",
       "5             Cursed-body        Marowak-alola           Jellicent\n",
       "6             Cursed-body        Marowak-totem           Jellicent\n",
       "7                Forecast       Castform-sunny      Castform-rainy\n",
       "8                Gluttony              Pansear             Panpour\n",
       "9                Gluttony             Simisear             Panpour"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query_5 = \"\"\"\n",
    "MATCH (t1:Tipo {nome: \"Fire\"})<-[:POSSUI_TIPO]-(p1:Pokemon)-[:POSSUI_HABILIDADE]->(h:Habilidade)\n",
    "MATCH (t2:Tipo {nome: \"Water\"})<-[:POSSUI_TIPO]-(p2:Pokemon)-[:POSSUI_HABILIDADE]->(h)\n",
    "RETURN h.nome AS HabilidadeCompartilhada, \n",
    "       p1.name AS PokemonFogo, \n",
    "       p2.name AS PokemonAgua\n",
    "ORDER BY HabilidadeCompartilhada ASC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        display(pd.DataFrame(session.run(query_5).data()))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1c1236f0",
   "metadata": {},
   "source": [
    "A Teia Completa do Metagame"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 207,
   "id": "41439225",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Torneio</th>\n",
       "      <th>Pokemon</th>\n",
       "      <th>TipoPrincipal</th>\n",
       "      <th>HabilidadeDominante</th>\n",
       "      <th>TaxaUso</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Smogon VGC</td>\n",
       "      <td>Flutter-mane</td>\n",
       "      <td>Ghost</td>\n",
       "      <td>Protosynthesis</td>\n",
       "      <td>59.43710</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Worlds VGC</td>\n",
       "      <td>Sneasler</td>\n",
       "      <td>Fighting</td>\n",
       "      <td>Pressure</td>\n",
       "      <td>38.21000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Worlds VGC</td>\n",
       "      <td>Sneasler</td>\n",
       "      <td>Fighting</td>\n",
       "      <td>Unburden</td>\n",
       "      <td>38.21000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Smogon VGC</td>\n",
       "      <td>Incineroar</td>\n",
       "      <td>Fire</td>\n",
       "      <td>Blaze</td>\n",
       "      <td>36.81468</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Smogon VGC</td>\n",
       "      <td>Ogerpon-wellspring</td>\n",
       "      <td>Grass</td>\n",
       "      <td>Water-absorb</td>\n",
       "      <td>35.07103</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Worlds VGC</td>\n",
       "      <td>Incineroar</td>\n",
       "      <td>Fire</td>\n",
       "      <td>Blaze</td>\n",
       "      <td>32.40000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Worlds VGC</td>\n",
       "      <td>Gholdengo</td>\n",
       "      <td>Steel</td>\n",
       "      <td>Good-as-gold</td>\n",
       "      <td>31.41000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Worlds VGC</td>\n",
       "      <td>Rillaboom</td>\n",
       "      <td>Grass</td>\n",
       "      <td>Overgrow</td>\n",
       "      <td>29.72000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Worlds VGC</td>\n",
       "      <td>Kingambit</td>\n",
       "      <td>Dark</td>\n",
       "      <td>Defiant</td>\n",
       "      <td>26.78000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Worlds VGC</td>\n",
       "      <td>Kingambit</td>\n",
       "      <td>Dark</td>\n",
       "      <td>Supreme-overlord</td>\n",
       "      <td>26.78000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Worlds VGC</td>\n",
       "      <td>Amoonguss</td>\n",
       "      <td>Grass</td>\n",
       "      <td>Effect-spore</td>\n",
       "      <td>26.58000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Smogon VGC</td>\n",
       "      <td>Tornadus-incarnate</td>\n",
       "      <td>Flying</td>\n",
       "      <td>Prankster</td>\n",
       "      <td>26.15361</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Smogon VGC</td>\n",
       "      <td>Raging-bolt</td>\n",
       "      <td>Electric</td>\n",
       "      <td>Protosynthesis</td>\n",
       "      <td>26.14914</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Smogon VGC</td>\n",
       "      <td>Urshifu-rapid</td>\n",
       "      <td>Fighting</td>\n",
       "      <td>Unseen-fist</td>\n",
       "      <td>25.61987</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       Torneio             Pokemon TipoPrincipal HabilidadeDominante   TaxaUso\n",
       "0   Smogon VGC        Flutter-mane         Ghost      Protosynthesis  59.43710\n",
       "1   Worlds VGC            Sneasler      Fighting            Pressure  38.21000\n",
       "2   Worlds VGC            Sneasler      Fighting            Unburden  38.21000\n",
       "3   Smogon VGC          Incineroar          Fire               Blaze  36.81468\n",
       "4   Smogon VGC  Ogerpon-wellspring         Grass        Water-absorb  35.07103\n",
       "5   Worlds VGC          Incineroar          Fire               Blaze  32.40000\n",
       "6   Worlds VGC           Gholdengo         Steel        Good-as-gold  31.41000\n",
       "7   Worlds VGC           Rillaboom         Grass            Overgrow  29.72000\n",
       "8   Worlds VGC           Kingambit          Dark             Defiant  26.78000\n",
       "9   Worlds VGC           Kingambit          Dark    Supreme-overlord  26.78000\n",
       "10  Worlds VGC           Amoonguss         Grass        Effect-spore  26.58000\n",
       "11  Smogon VGC  Tornadus-incarnate        Flying           Prankster  26.15361\n",
       "12  Smogon VGC         Raging-bolt      Electric      Protosynthesis  26.14914\n",
       "13  Smogon VGC       Urshifu-rapid      Fighting         Unseen-fist  25.61987"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query_6 = \"\"\"\n",
    "MATCH (t:Tipo)<-[:POSSUI_TIPO {ordem: \"principal\"}]-(p:Pokemon)-[:POSSUI_HABILIDADE {tipo: \"comum\"}]->(h:Habilidade)\n",
    "MATCH (p)-[r:COMPETIU_EM]->(torneio:Torneio {ano: 2024})\n",
    "WHERE r.taxa_uso > 25.0\n",
    "RETURN torneio.nome AS Torneio, \n",
    "       p.name AS Pokemon, \n",
    "       t.nome AS TipoPrincipal, \n",
    "       h.nome AS HabilidadeDominante, \n",
    "       r.taxa_uso AS TaxaUso\n",
    "ORDER BY TaxaUso DESC\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        display(pd.DataFrame(session.run(query_6).data()))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2b30ae7d",
   "metadata": {},
   "source": [
    "## Categoria 3 — Consultas Sérias   (Análise Estratégica do Metagame e Data Analytics)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "db150de2",
   "metadata": {},
   "source": [
    "Centralização do Meta - Concentração de Pokémon no Top Tier (>30% uso) no Worlds"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 208,
   "id": "17c2e746",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Ano</th>\n",
       "      <th>Pokemon</th>\n",
       "      <th>TaxaUso</th>\n",
       "      <th>Geracao</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2022</td>\n",
       "      <td>Incineroar</td>\n",
       "      <td>73.41</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2022</td>\n",
       "      <td>Zacian-crowned</td>\n",
       "      <td>53.65</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2022</td>\n",
       "      <td>Kyogre</td>\n",
       "      <td>36.87</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2022</td>\n",
       "      <td>Grimmsnarl</td>\n",
       "      <td>30.40</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2023</td>\n",
       "      <td>Iron-hands</td>\n",
       "      <td>51.32</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>2023</td>\n",
       "      <td>Flutter-mane</td>\n",
       "      <td>51.19</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>2023</td>\n",
       "      <td>Landorus-therian</td>\n",
       "      <td>45.80</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>2023</td>\n",
       "      <td>Ogerpon-wellspring</td>\n",
       "      <td>31.03</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>2023</td>\n",
       "      <td>Heatran</td>\n",
       "      <td>30.06</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>2024</td>\n",
       "      <td>Sneasler</td>\n",
       "      <td>38.21</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>2024</td>\n",
       "      <td>Incineroar</td>\n",
       "      <td>32.40</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>2024</td>\n",
       "      <td>Gholdengo</td>\n",
       "      <td>31.41</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     Ano             Pokemon  TaxaUso Geracao\n",
       "0   2022          Incineroar    73.41       7\n",
       "1   2022      Zacian-crowned    53.65       8\n",
       "2   2022              Kyogre    36.87       3\n",
       "3   2022          Grimmsnarl    30.40       8\n",
       "4   2023          Iron-hands    51.32       9\n",
       "5   2023        Flutter-mane    51.19       9\n",
       "6   2023    Landorus-therian    45.80       5\n",
       "7   2023  Ogerpon-wellspring    31.03       9\n",
       "8   2023             Heatran    30.06       4\n",
       "9   2024            Sneasler    38.21       8\n",
       "10  2024          Incineroar    32.40       7\n",
       "11  2024           Gholdengo    31.41       9"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query_7 = \"\"\"\n",
    "MATCH (p:Pokemon)-[r:COMPETIU_EM]->(t:Torneio {nome: \"Worlds VGC\"})\n",
    "WHERE r.taxa_uso > 30.0\n",
    "RETURN t.ano AS Ano, \n",
    "       p.name AS Pokemon, \n",
    "       r.taxa_uso AS TaxaUso, \n",
    "       p.generation AS Geracao\n",
    "ORDER BY Ano ASC, TaxaUso DESC\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        display(pd.DataFrame(session.run(query_7).data()))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d6064dc7",
   "metadata": {},
   "source": [
    "Mapeamento de Hiperconsistência Histórica (Presença nos 6 Torneios Simultâneos)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 209,
   "id": "896bc452",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Pokemon</th>\n",
       "      <th>TorneiosAtivos</th>\n",
       "      <th>UsoAcumulado</th>\n",
       "      <th>MediaPorTorneio</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Rillaboom</td>\n",
       "      <td>6</td>\n",
       "      <td>149.41</td>\n",
       "      <td>24.90</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Amoonguss</td>\n",
       "      <td>6</td>\n",
       "      <td>127.17</td>\n",
       "      <td>21.20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Grimmsnarl</td>\n",
       "      <td>6</td>\n",
       "      <td>74.62</td>\n",
       "      <td>12.44</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Indeedee-female</td>\n",
       "      <td>6</td>\n",
       "      <td>58.11</td>\n",
       "      <td>9.69</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Torkoal</td>\n",
       "      <td>6</td>\n",
       "      <td>38.55</td>\n",
       "      <td>6.42</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Gastrodon-west</td>\n",
       "      <td>6</td>\n",
       "      <td>37.37</td>\n",
       "      <td>6.23</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Ninetales-alola</td>\n",
       "      <td>6</td>\n",
       "      <td>27.45</td>\n",
       "      <td>4.57</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Gastrodon-east</td>\n",
       "      <td>6</td>\n",
       "      <td>26.64</td>\n",
       "      <td>4.44</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Garchomp</td>\n",
       "      <td>6</td>\n",
       "      <td>24.42</td>\n",
       "      <td>4.07</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Volcarona</td>\n",
       "      <td>6</td>\n",
       "      <td>22.99</td>\n",
       "      <td>3.83</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Arcanine</td>\n",
       "      <td>6</td>\n",
       "      <td>22.28</td>\n",
       "      <td>3.71</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Talonflame</td>\n",
       "      <td>6</td>\n",
       "      <td>20.59</td>\n",
       "      <td>3.43</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Dragapult</td>\n",
       "      <td>6</td>\n",
       "      <td>20.28</td>\n",
       "      <td>3.38</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Tyranitar</td>\n",
       "      <td>6</td>\n",
       "      <td>14.51</td>\n",
       "      <td>2.42</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Gothitelle</td>\n",
       "      <td>6</td>\n",
       "      <td>9.66</td>\n",
       "      <td>1.61</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Dusclops</td>\n",
       "      <td>6</td>\n",
       "      <td>9.57</td>\n",
       "      <td>1.59</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Clefairy</td>\n",
       "      <td>6</td>\n",
       "      <td>8.45</td>\n",
       "      <td>1.41</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Milotic</td>\n",
       "      <td>6</td>\n",
       "      <td>8.19</td>\n",
       "      <td>1.36</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Hatterene</td>\n",
       "      <td>6</td>\n",
       "      <td>7.93</td>\n",
       "      <td>1.32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Hydreigon</td>\n",
       "      <td>6</td>\n",
       "      <td>7.24</td>\n",
       "      <td>1.21</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Weezing</td>\n",
       "      <td>6</td>\n",
       "      <td>5.23</td>\n",
       "      <td>0.87</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Sableye</td>\n",
       "      <td>6</td>\n",
       "      <td>5.11</td>\n",
       "      <td>0.85</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Salamence</td>\n",
       "      <td>6</td>\n",
       "      <td>4.37</td>\n",
       "      <td>0.73</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Gyarados</td>\n",
       "      <td>6</td>\n",
       "      <td>3.72</td>\n",
       "      <td>0.62</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Weezing-galar</td>\n",
       "      <td>6</td>\n",
       "      <td>3.51</td>\n",
       "      <td>0.58</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Bronzong</td>\n",
       "      <td>6</td>\n",
       "      <td>3.10</td>\n",
       "      <td>0.52</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Azumarill</td>\n",
       "      <td>6</td>\n",
       "      <td>2.71</td>\n",
       "      <td>0.45</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Snorlax</td>\n",
       "      <td>6</td>\n",
       "      <td>2.52</td>\n",
       "      <td>0.42</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Mamoswine</td>\n",
       "      <td>6</td>\n",
       "      <td>2.43</td>\n",
       "      <td>0.40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Tsareena</td>\n",
       "      <td>6</td>\n",
       "      <td>2.08</td>\n",
       "      <td>0.35</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Chandelure</td>\n",
       "      <td>6</td>\n",
       "      <td>1.35</td>\n",
       "      <td>0.23</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Pokemon  TorneiosAtivos  UsoAcumulado  MediaPorTorneio\n",
       "0         Rillaboom               6        149.41            24.90\n",
       "1         Amoonguss               6        127.17            21.20\n",
       "2        Grimmsnarl               6         74.62            12.44\n",
       "3   Indeedee-female               6         58.11             9.69\n",
       "4           Torkoal               6         38.55             6.42\n",
       "5    Gastrodon-west               6         37.37             6.23\n",
       "6   Ninetales-alola               6         27.45             4.57\n",
       "7    Gastrodon-east               6         26.64             4.44\n",
       "8          Garchomp               6         24.42             4.07\n",
       "9         Volcarona               6         22.99             3.83\n",
       "10         Arcanine               6         22.28             3.71\n",
       "11       Talonflame               6         20.59             3.43\n",
       "12        Dragapult               6         20.28             3.38\n",
       "13        Tyranitar               6         14.51             2.42\n",
       "14       Gothitelle               6          9.66             1.61\n",
       "15         Dusclops               6          9.57             1.59\n",
       "16         Clefairy               6          8.45             1.41\n",
       "17          Milotic               6          8.19             1.36\n",
       "18        Hatterene               6          7.93             1.32\n",
       "19        Hydreigon               6          7.24             1.21\n",
       "20          Weezing               6          5.23             0.87\n",
       "21          Sableye               6          5.11             0.85\n",
       "22        Salamence               6          4.37             0.73\n",
       "23         Gyarados               6          3.72             0.62\n",
       "24    Weezing-galar               6          3.51             0.58\n",
       "25         Bronzong               6          3.10             0.52\n",
       "26        Azumarill               6          2.71             0.45\n",
       "27          Snorlax               6          2.52             0.42\n",
       "28        Mamoswine               6          2.43             0.40\n",
       "29         Tsareena               6          2.08             0.35\n",
       "30       Chandelure               6          1.35             0.23"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query_8 = \"\"\"\n",
    "MATCH (p:Pokemon)-[r:COMPETIU_EM]->(t:Torneio)\n",
    "WITH p, \n",
    "     COUNT(CASE WHEN r.taxa_uso > 0 THEN 1 END) AS TorneiosAtivos, \n",
    "     SUM(r.taxa_uso) AS UsoTotal\n",
    "WHERE TorneiosAtivos = 6\n",
    "RETURN p.name AS Pokemon, \n",
    "       TorneiosAtivos, \n",
    "       ROUND(UsoTotal, 2) AS UsoAcumulado, \n",
    "       ROUND(UsoTotal / 6, 2) AS MediaPorTorneio\n",
    "ORDER BY UsoAcumulado DESC\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        display(pd.DataFrame(session.run(query_8).data()))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4685d724",
   "metadata": {},
   "source": [
    "Mapeamento de Habilidades Ocultas Compartilhadas no Top Tier de 2024"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 210,
   "id": "c5ee3ec6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>HabilidadeOculta</th>\n",
       "      <th>Pokemon</th>\n",
       "      <th>TaxaUso</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Defiant</td>\n",
       "      <td>Tornadus-incarnate</td>\n",
       "      <td>26.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Defiant</td>\n",
       "      <td>Annihilape</td>\n",
       "      <td>16.80</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Grassy-surge</td>\n",
       "      <td>Rillaboom</td>\n",
       "      <td>26.02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Intimidate</td>\n",
       "      <td>Incineroar</td>\n",
       "      <td>34.61</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Liquid-voice</td>\n",
       "      <td>Primarina</td>\n",
       "      <td>17.33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Multiscale</td>\n",
       "      <td>Dragonite</td>\n",
       "      <td>21.84</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Poison-touch</td>\n",
       "      <td>Sneasler</td>\n",
       "      <td>38.21</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Pressure</td>\n",
       "      <td>Kingambit</td>\n",
       "      <td>26.78</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Rain-dish</td>\n",
       "      <td>Pelipper</td>\n",
       "      <td>19.51</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Regenerator</td>\n",
       "      <td>Amoonguss</td>\n",
       "      <td>23.23</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Rough-skin</td>\n",
       "      <td>Garchomp</td>\n",
       "      <td>16.46</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Sap-sipper</td>\n",
       "      <td>Farigiraf</td>\n",
       "      <td>16.52</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Sheer-force</td>\n",
       "      <td>Landorus-incarnate</td>\n",
       "      <td>17.09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Stalwart</td>\n",
       "      <td>Archaludon</td>\n",
       "      <td>22.70</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   HabilidadeOculta             Pokemon  TaxaUso\n",
       "0           Defiant  Tornadus-incarnate    26.15\n",
       "1           Defiant          Annihilape    16.80\n",
       "2      Grassy-surge           Rillaboom    26.02\n",
       "3        Intimidate          Incineroar    34.61\n",
       "4      Liquid-voice           Primarina    17.33\n",
       "5        Multiscale           Dragonite    21.84\n",
       "6      Poison-touch            Sneasler    38.21\n",
       "7          Pressure           Kingambit    26.78\n",
       "8         Rain-dish            Pelipper    19.51\n",
       "9       Regenerator           Amoonguss    23.23\n",
       "10       Rough-skin            Garchomp    16.46\n",
       "11       Sap-sipper           Farigiraf    16.52\n",
       "12      Sheer-force  Landorus-incarnate    17.09\n",
       "13         Stalwart          Archaludon    22.70"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query_9 = \"\"\"\n",
    "MATCH (h:Habilidade)<-[:POSSUI_HABILIDADE {tipo: \"oculta\"}]-(p:Pokemon)-[r:COMPETIU_EM]->(t:Torneio {ano: 2024})\n",
    "WHERE r.taxa_uso > 15.0\n",
    "WITH h.nome AS HabilidadeOculta, \n",
    "     p.name AS Pokemon, \n",
    "     AVG(r.taxa_uso) AS MediaUso\n",
    "RETURN HabilidadeOculta, \n",
    "       Pokemon, \n",
    "       ROUND(MediaUso, 2) AS TaxaUso\n",
    "ORDER BY HabilidadeOculta ASC, TaxaUso DESC\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        display(pd.DataFrame(session.run(query_9).data()))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b050e68f",
   "metadata": {},
   "source": [
    "Análise de Evolução - Top 5 Pokémon Veteranos com Maior Crescimento (2022 vs 2024)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 211,
   "id": "61b9b155",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Pokemon</th>\n",
       "      <th>UsoMedio_2022</th>\n",
       "      <th>UsoMedio_2024</th>\n",
       "      <th>GanhoDeTaxa</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Urshifu-rapid</td>\n",
       "      <td>4.57</td>\n",
       "      <td>25.62</td>\n",
       "      <td>21.05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Urshifu-single</td>\n",
       "      <td>7.58</td>\n",
       "      <td>24.98</td>\n",
       "      <td>17.40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Landorus-incarnate</td>\n",
       "      <td>0.24</td>\n",
       "      <td>17.09</td>\n",
       "      <td>16.84</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Dragonite</td>\n",
       "      <td>0.25</td>\n",
       "      <td>16.18</td>\n",
       "      <td>15.94</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Tornadus-incarnate</td>\n",
       "      <td>13.85</td>\n",
       "      <td>26.15</td>\n",
       "      <td>12.31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Entei</td>\n",
       "      <td>0.95</td>\n",
       "      <td>12.62</td>\n",
       "      <td>11.66</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Pelipper</td>\n",
       "      <td>0.12</td>\n",
       "      <td>11.74</td>\n",
       "      <td>11.62</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Primarina</td>\n",
       "      <td>0.09</td>\n",
       "      <td>9.94</td>\n",
       "      <td>9.85</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Garchomp</td>\n",
       "      <td>0.20</td>\n",
       "      <td>8.33</td>\n",
       "      <td>8.13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Calyrex-ice-rider</td>\n",
       "      <td>13.33</td>\n",
       "      <td>20.95</td>\n",
       "      <td>7.62</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Ninetales-alola</td>\n",
       "      <td>0.08</td>\n",
       "      <td>6.44</td>\n",
       "      <td>6.36</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Dragapult</td>\n",
       "      <td>1.22</td>\n",
       "      <td>7.48</td>\n",
       "      <td>6.26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Volcarona</td>\n",
       "      <td>0.80</td>\n",
       "      <td>5.45</td>\n",
       "      <td>4.65</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Amoonguss</td>\n",
       "      <td>18.88</td>\n",
       "      <td>23.23</td>\n",
       "      <td>4.35</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Indeedee-male</td>\n",
       "      <td>0.58</td>\n",
       "      <td>4.93</td>\n",
       "      <td>4.35</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Cresselia</td>\n",
       "      <td>0.06</td>\n",
       "      <td>4.17</td>\n",
       "      <td>4.10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Torkoal</td>\n",
       "      <td>2.64</td>\n",
       "      <td>6.53</td>\n",
       "      <td>3.89</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Calyrex-shadow-rider</td>\n",
       "      <td>16.27</td>\n",
       "      <td>20.12</td>\n",
       "      <td>3.86</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Zamazenta-crowned</td>\n",
       "      <td>0.61</td>\n",
       "      <td>4.12</td>\n",
       "      <td>3.51</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Tyranitar</td>\n",
       "      <td>0.16</td>\n",
       "      <td>3.63</td>\n",
       "      <td>3.47</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 Pokemon  UsoMedio_2022  UsoMedio_2024  GanhoDeTaxa\n",
       "0          Urshifu-rapid           4.57          25.62        21.05\n",
       "1         Urshifu-single           7.58          24.98        17.40\n",
       "2     Landorus-incarnate           0.24          17.09        16.84\n",
       "3              Dragonite           0.25          16.18        15.94\n",
       "4     Tornadus-incarnate          13.85          26.15        12.31\n",
       "5                  Entei           0.95          12.62        11.66\n",
       "6               Pelipper           0.12          11.74        11.62\n",
       "7              Primarina           0.09           9.94         9.85\n",
       "8               Garchomp           0.20           8.33         8.13\n",
       "9      Calyrex-ice-rider          13.33          20.95         7.62\n",
       "10       Ninetales-alola           0.08           6.44         6.36\n",
       "11             Dragapult           1.22           7.48         6.26\n",
       "12             Volcarona           0.80           5.45         4.65\n",
       "13             Amoonguss          18.88          23.23         4.35\n",
       "14         Indeedee-male           0.58           4.93         4.35\n",
       "15             Cresselia           0.06           4.17         4.10\n",
       "16               Torkoal           2.64           6.53         3.89\n",
       "17  Calyrex-shadow-rider          16.27          20.12         3.86\n",
       "18     Zamazenta-crowned           0.61           4.12         3.51\n",
       "19             Tyranitar           0.16           3.63         3.47"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query_10 = \"\"\"\n",
    "MATCH (p:Pokemon)-[r22:COMPETIU_EM]->(t22:Torneio {ano: 2022})\n",
    "MATCH (p)-[r24:COMPETIU_EM]->(t24:Torneio {ano: 2024})\n",
    "WHERE r22.taxa_uso > 0.0 AND r24.taxa_uso > 0.0\n",
    "WITH p.name AS Pokemon, \n",
    "     AVG(r22.taxa_uso) AS Media22, \n",
    "     AVG(r24.taxa_uso) AS Media24\n",
    "WITH Pokemon, \n",
    "     Media22, \n",
    "     Media24, \n",
    "     (Media24 - Media22) AS Crescimento\n",
    "RETURN Pokemon, \n",
    "       ROUND(Media22, 2) AS UsoMedio_2022, \n",
    "       ROUND(Media24, 2) AS UsoMedio_2024, \n",
    "       ROUND(Crescimento, 2) AS GanhoDeTaxa\n",
    "ORDER BY GanhoDeTaxa DESC\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        display(pd.DataFrame(session.run(query_10).data()))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.14.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
